Repository: mr258876/PRISM-Utility
Catalog: PRISM Utility/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# ScanDebug_Runtime_DeviceStateDetected
source: Device detected
zh_cn: 已检测到设备

# ScanDebug_Runtime_DeviceStateWaiting
source: Waiting for device
zh_cn: 等待设备

# ScanDebug_IlluminationWorkModeHeader
source: Work mode
zh_cn: 工作模式

# ScanDebug_IlluminationWorkModeOff
source: Off
zh_cn: 关闭

# ScanDebug_IlluminationWorkModeSteady
source: Steady
zh_cn: 常亮

# ScanDebug_IlluminationWorkModeSync
source: Sync
zh_cn: 同步

# ScanDebug_ProfileStateNoProfile
source: No profile
zh_cn: 无配置

# ScanDebug_ProfileStateUnsaved
source: Unsaved changes
zh_cn: 有未保存更改

# ScanDebug_ProfileStateSaved
source: Saved
zh_cn: 已保存

# ScanDebug_AcquisitionPlanNoActiveChannels
source: No active acquisition channels.
zh_cn: 无活动采集通道。

# ScanDebug_AcquisitionPlanSelectedChannels
source: {0} acquisition channels selected.
zh_cn: 已选择 {0} 个采集通道。

# ScanDebug_AcquisitionPlanCurrentChannel
source: Current acquisition channel: {0}.
zh_cn: 当前采集通道：{0}。

# ScanDebug_ChannelCalibrationCurrentSummary
source: Calibration channel: {0} ({1}).
zh_cn: 校准通道：{0}（{1}）。

# ScanDebug_ChannelLedBindingUnassigned
source: Unassigned
zh_cn: 未分配

# ScanDebug_Runtime_ChannelStatusSaved
source: Saved
zh_cn: 已保存

# ScanDebug_Runtime_ChannelStatusModified
source: Modified
zh_cn: 已修改

# ScanDebug_Runtime_ChannelStatusUnconfigured
source: Missing
zh_cn: 缺少

# ScanDebug_Runtime_ChannelStatusInvalid
source: Invalid
zh_cn: 无效

# ScanDebug_Runtime_ChannelStatusMissing
source: Missing
zh_cn: 缺少

# ScanDebug_Runtime_ChannelStatusCopiedUnverified
source: Copied-Unverified
zh_cn: 已复制待验证

# ScanDebug_Runtime_ChannelStatusSelected
source: selected
zh_cn: 已选择

# ScanDebug_Runtime_ChannelStatusNotSelected
source: not selected
zh_cn: 未选择

# ScanDebug_CalibrationCopySourceComboBox.Header
source: Copy from channel
zh_cn: 复制来源通道

source: Copy calibration source
zh_cn: 复制校准来源

source: Select a saved channel to stage its calibration values on the selected channel.
zh_cn: 选择已保存的通道，将其校准值暂存到所选通道。

# ScanDebug_CopyCalibrationProfileButton.Content
source: Copy to selected channel
zh_cn: 复制到所选通道

source: Copy calibration to selected channel
zh_cn: 复制校准到所选通道

source: Copying stages values only. Use Save channel calibration to persist them.
zh_cn: 复制只会暂存数值。保存通道校准后才会写入。

# ScanDebug_CalibrationCopyHelperText.Text
source: Copying stages values for the selected channel only. Use Save channel calibration to persist them.
zh_cn: 复制只会暂存所选通道的数值。保存通道校准后才会写入。

# ScanDebug_DisabledReasonReady
source: Ready.
zh_cn: 就绪。

# ScanDebug_DisabledReasonScanRunning
source: A scan is running.
zh_cn: 扫描正在运行。

# ScanDebug_DisabledReasonOutputRunning
source: An output operation is running.
zh_cn: 输出操作正在运行。

# ScanDebug_DisabledReasonDeviceBusy
source: The device is busy.
zh_cn: 设备忙。

# ScanDebug_DisabledReasonConnectDevice
source: Connect the device first.
zh_cn: 请先连接设备。

# ScanDebug_DisabledReasonNoAcquisitionChannels
source: Select at least one acquisition channel.
zh_cn: 至少选择一个采集通道。

# ScanDebug_DisabledReasonConfirmAllAcquisitionChannels
source: Confirm all active acquisition channels.
zh_cn: 请确认所有活动采集通道。

# ScanDebug_DisabledReasonInvalidRows
source: Enter a valid row count.
zh_cn: 请输入有效行数。

# ScanDebug_DisabledReasonNoCapture
source: No captured scan data is available.
zh_cn: 没有可用的扫描捕获数据。

# ScanDebug_DisabledReasonRequiresFourChannelCapture
source: Export requires a four-channel capture.
zh_cn: 导出需要四通道捕获。

# ScanDebug_DisabledReasonRequiresSingleOrFourChannelCapture
source: DNG export supports one selected channel or a complete four-channel capture.
zh_cn: DNG 导出支持单个所选通道，或完整四通道捕获。

# ScanDebug_DisabledReasonUnavailable
source: Unavailable.
zh_cn: 不可用。

# ScanDebug_ProfileChannelOverviewUnusedItem
source: {0}: unused
zh_cn: {0}：未使用

# ScanDebug_ProfileChannelOverviewCalibrationSaved
source: calibration saved
zh_cn: 校准已保存

# ScanDebug_ProfileChannelOverviewCalibrationMissing
source: calibration missing
zh_cn: 缺少校准

# ScanDebug_PreviewEmptyTitleScanning
source: Scanning
zh_cn: 扫描中

# ScanDebug_PreviewEmptyTitleDeviceDetected
source: Device detected
zh_cn: 已检测到设备

# ScanDebug_PreviewEmptyTitleNoDevice
source: No device connected
zh_cn: 未连接设备

# ScanDebug_PreviewEmptyTitleChannelUncalibrated
source: {0} is not calibrated
zh_cn: {0} 未校准

# ScanDebug_PreviewEmptyTitleCapturedNoPreview
source: Captured data has no preview
zh_cn: 捕获数据无预览

# ScanDebug_PreviewEmptyTitleReady
source: Ready for preview
zh_cn: 预览就绪

# ScanDebug_PreviewEmptyDescriptionScanning
source: Preview will update as scan data arrives.
zh_cn: 扫描数据到达时会更新预览。

# ScanDebug_PreviewEmptyDescriptionDeviceDetected
source: Connect the scanner before starting acquisition.
zh_cn: 开始采集前请连接扫描仪。

# ScanDebug_PreviewEmptyDescriptionNoDevice
source: Attach a PRISM scanner to begin.
zh_cn: 连接 PRISM 扫描仪后开始。

# ScanDebug_PreviewEmptyDescriptionChannelUncalibrated
source: Save a calibration profile for {0} on {1} before previewing.
zh_cn: 预览前请为 {0}（{1}）保存校准配置。

# ScanDebug_PreviewEmptyDescriptionCapturedNoPreview
source: Enable preview or choose a supported row count to view captured data.
zh_cn: 启用预览或选择支持的行数以查看捕获数据。

# ScanDebug_PreviewEmptyDescriptionReady
source: Start a scan with {0} to render the preview.
zh_cn: 使用 {0} 开始扫描以渲染预览。

# ScanDebug_Runtime_ColumnSampleUnavailable
source: Column sampling is unavailable until a valid preview is captured.
zh_cn: 捕获有效预览前无法进行列采样。

# ScanDebug_Runtime_ColumnSampleUnavailableWithError
source: Columns {0}-{1}: {2}
zh_cn: 列 {0}-{1}：{2}

# ScanDebug_Runtime_ColumnSampleSavedLevels
source: Saved black {0}, white {1}.
zh_cn: 已保存黑电平 {0}，白电平 {1}。

# ScanDebug_Runtime_ColumnSampleSummary
source: Columns {0}-{1} ({2} px), mean {3}. {4}
zh_cn: 列 {0}-{1}（{2} px），均值 {3}。{4}

# ScanDebug_Runtime_ColumnSampleNoPreviewSamples
source: No preview samples are available in the selected range.
zh_cn: 所选范围内没有预览样本。

# ScanDebug_Runtime_ColumnSampleNoValidPixels
source: No valid pixels were found in the selected range.
zh_cn: 所选范围内没有有效像素。

# ScanDebug_Runtime_LimitDistanceMinimum
source: {0} must be at least {1} mm.
zh_cn: {0} 必须至少为 {1} mm。

# ScanDebug_Runtime_LimitDistanceInvalidNumber
source: {0} must be a number.
zh_cn: {0} 必须是数字。

# ScanDebug_Runtime_LimitDistanceCurrentBelowMinimum
source: {0} must be at least {1} mm; current {2} mm.
zh_cn: {0} 必须至少为 {1} mm；当前为 {2} mm。

# ScanDebug_Runtime_LimitLabelTiltProbeDistance
source: Tilt probe distance
zh_cn: 倾斜探测距离

# ScanDebug_Runtime_LimitLabelZProbeDistance
source: Z probe distance
zh_cn: Z 探测距离

# ScanDebug_Runtime_LimitLabelManualFocusDistance
source: Manual focus distance
zh_cn: 手动对焦距离

# ScanDebug_Runtime_CalibrationChannel_NoSavedProfileLoadedYet
source: Calibration profile channel: {0} (no saved profile loaded yet).
zh_cn: 校准配置通道：{0}（尚未加载已保存配置）。

# ScanDebug_Runtime_CalibrationChannel_NoSavedProfile
source: Calibration profile channel: {0} (no saved profile).
zh_cn: 校准配置通道：{0}（无已保存配置）。

# ScanDebug_Runtime_CalibrationChannel_SavedProfileLoaded
source: Calibration profile channel: {0} (saved profile loaded).
zh_cn: 校准配置通道：{0}（已加载已保存配置）。

# ScanDebug_Runtime_CalibrationChannel_ProfileCleared
source: Calibration profile channel: {0} (profile cleared).
zh_cn: 校准配置通道：{0}（配置已清除）。

# ScanDebug_Runtime_CalibrationChannel_LoadFailed
source: Calibration profile channel: {0} (load failed: {1}).
zh_cn: 校准配置通道：{0}（加载失败：{1}）。

# ScanDebug_Runtime_CalibrationChannel_SavedAt
source: Calibration profile channel: {0} (saved at {1}).
zh_cn: 校准配置通道：{0}（保存于 {1}）。

# ScanDebug_Runtime_FilmProfileUntitled
source: Untitled Film Profile
zh_cn: 未命名胶片配置

# ScanDebug_Runtime_RoiInputsSynchronized
source: ROI range inputs are synchronized with the selected ROI.
zh_cn: ROI 范围输入已与所选 ROI 同步。

# ScanDebug_Runtime_RoiRangeChanged
source: ROI range changed. Click Apply ROI to commit numeric edits.
zh_cn: ROI 已修改，尚未应用。 请点击“应用 ROI”。

# ScanDebug_Runtime_RoiStartIntegerRequired
source: ROI Start must be an integer column index.
zh_cn: ROI 起始必须是整数列索引。

# ScanDebug_Runtime_RoiEndIntegerRequired
source: ROI End must be an integer column index.
zh_cn: ROI 结束必须是整数列索引。

# ScanDebug_Runtime_RoiRangeApplied
source: ROI range applied from numeric inputs.
zh_cn: 已根据数值输入应用 ROI 范围。

# ScanDebug_Runtime_RoiNumericMirror
source: Numeric ROI range mirrors {0}: {1} ~ {2}.
zh_cn: 数值 ROI 范围与 {0} 同步：{1} ~ {2}。

# ScanDebug_Runtime_RoiEditModeOn
source: edit mode: ON
zh_cn: 编辑模式：开

# ScanDebug_Runtime_RoiEditModeOff
source: edit mode: OFF
zh_cn: 编辑模式：关

# ScanDebug_Runtime_RoiStatus
source: Selected ROI: {0} | columns {1} ~ {2} ({3} px) | {4}.
zh_cn: 所选 ROI：{0} | 列 {1} ~ {2}（{3} px）| {4}。

# ScanDebug_Runtime_RoiSelectionBwActive
source: BW Active
zh_cn: BW 活动区

# ScanDebug_Runtime_RoiSelectionBwShield
source: BW Shield
zh_cn: BW 屏蔽区

# ScanDebug_Runtime_RoiSelectionFocusOverall
source: Focus Overall
zh_cn: 整体对焦

# ScanDebug_Runtime_RoiSelectionFocusLeft
source: Focus Left
zh_cn: 左侧对焦

# ScanDebug_Runtime_RoiSelectionFocusRight
source: Focus Right
zh_cn: 右侧对焦

# ScanDebug_Runtime_StatusWaitingForDevicesShort
source: Waiting for scanner devices...
zh_cn: 正在等待扫描仪设备...

# ScanDebug_Runtime_StatusWaitingForDevices
source: Waiting for scanner devices 1D50:619C and 1D50:619D.
zh_cn: 正在等待扫描仪设备 1D50:619C 和 1D50:619D。

# ScanDebug_Runtime_StatusDevicesDetected
source: 619C/619D detected. Click Connect Devices to validate endpoints and open sessions.
zh_cn: 已检测到 619C/619D。点击“连接设备”以验证端点并打开会话。

# ScanDebug_Runtime_ExposureTimeIdle
source: Exposure time: -
zh_cn: 曝光时间：-

# ScanDebug_Runtime_ExposureTimeFormat
source: Exposure time: {0}
zh_cn: 曝光时间：{0}

# ScanDebug_Runtime_OffsetAmplitudeIdle
source: Offset amplitude: -
zh_cn: 偏移：-

# ScanDebug_Runtime_OffsetAmplitudeFormat
source: Offset amplitude: {0}
zh_cn: 偏移：{0}

# ScanDebug_Runtime_GainIdle
source: Gain: -
zh_cn: 增益：-

# ScanDebug_Runtime_GainFormat
source: Gain: {0}
zh_cn: 增益：{0}

# ScanDebug_Runtime_SystemClockIdle
source: System clock: -
zh_cn: 系统时钟：-

# ScanDebug_Runtime_SystemClockFormat
source: System clock: {0}
zh_cn: 系统时钟：{0}

# ScanDebug_Runtime_IlluminationSummaryIdle
source: Illumination state: -
zh_cn: 照明状态：-

# ScanDebug_Runtime_MotionSummaryIdle
source: Motion state: -
zh_cn: 运动状态：-

# ScanDebug_Runtime_MotorStatusIdle
source: State: -
zh_cn: 状态：-

# ScanDebug_Runtime_AutofocusIdle
source: Autofocus: idle.
zh_cn: 自动对焦：空闲。

# ScanDebug_Runtime_StatusExportCanceled
source: Export canceled.
zh_cn: 导出已取消。

# ScanDebug_Runtime_StatusExportFailed
source: Export failed: {0}
zh_cn: 导出失败：{0}

# ScanDebug_Runtime_StatusExportNoWorkflowPass
source: No workflow pass is available for DNG export.
zh_cn: 没有可用于 DNG 导出的 workflow 采集轮次。

# ScanDebug_Runtime_StatusExportRequiresFourChannelWorkflow
source: DNG export currently requires a full {1}-channel workflow result, but this scan captured {0} pass(es).
zh_cn: 当前 DNG 导出要求完整的 {1} 通道 workflow 结果，而这次扫描只采集了 {0} 轮。

# ScanDebug_Runtime_StatusExportRequiresSingleOrFourChannelWorkflow
source: DNG export supports one selected channel or a complete four-channel workflow result. This scan captured {0} selected channels.
zh_cn: DNG 导出支持单个所选通道，或完整四通道 workflow 结果。本次扫描采集了 {0} 个所选通道。

# ScanDebug_Runtime_StatusUsbDebugActive
source: USB Debugging is active. Stop it before connecting Scan Debug.
zh_cn: USB 调试处于活动状态。连接扫描调试前请先停止它。

# ScanDebug_Runtime_StatusLoadingParameters
source: Scanner sessions connected. Loading parameters...
zh_cn: 扫描仪会话已连接。正在加载参数...

# ScanDebug_Runtime_StatusParametersLoaded
source: Parameters loaded
zh_cn: 参数已加载

# ScanDebug_Runtime_StatusParameterLoadUnavailable
source: Parameter load unavailable: {0}
zh_cn: 参数加载不可用：{0}

# ScanDebug_Runtime_StatusIlluminationLoaded
source: Illumination state loaded
zh_cn: 照明状态已加载

# ScanDebug_Runtime_StatusIlluminationUnavailable
source: Illumination unavailable: {0}
zh_cn: 照明不可用：{0}

# ScanDebug_Runtime_StatusMotionLoaded
source: Motion state loaded
zh_cn: 运动状态已加载

# ScanDebug_Runtime_StatusMotionUnavailable
source: Motion unavailable: {0}
zh_cn: 运动不可用：{0}

# ScanDebug_Runtime_StatusWarmUpEnabled
source: Warm-up enabled
zh_cn: 预热已启用

# ScanDebug_Runtime_StatusWarmUpFailed
source: Warm-up failed: {0}
zh_cn: 预热失败：{0}

# ScanDebug_Runtime_StatusConnectedWithNotes
source: Scanner sessions connected. {0}.
zh_cn: 扫描仪会话已连接。{0}。

# ScanDebug_Runtime_StatusConnected
source: Scanner sessions connected.
zh_cn: 扫描仪会话已连接。

# ScanDebug_Runtime_StatusConnectFailed
source: Connect failed: {0}
zh_cn: 连接失败：{0}

# ScanDebug_Runtime_StatusWarmUpDisableBeforeDisconnectFailed
source: Warm-up disable before disconnect failed: {0}
zh_cn: 断开连接前禁用预热失败：{0}

# ScanDebug_Runtime_StatusDisconnectedReconnect
source: Disconnected. Click Connect Devices to reconnect.
zh_cn: 已断开连接。点击“连接设备”重新连接。

# ScanDebug_Runtime_StatusDisconnected
source: Disconnected.
zh_cn: 已断开连接。

# ScanDebug_Runtime_ServiceDevicesNotDetected
source: Scanner devices 619C and 619D were not detected.
zh_cn: 未检测到扫描仪设备 619C 和 619D。

# ScanDebug_Runtime_ServiceDeviceDisappearedDuringConnect
source: A scanner device disappeared during connect.
zh_cn: 连接过程中有扫描仪设备消失。

# ScanDebug_Runtime_ServiceEndpointCheckFailed
source: Endpoint check failed. Required endpoints: 619C IN 0x82 and 619D OUT 0x01 / IN 0x81.
zh_cn: 端点检查失败。所需端点：619C IN 0x82 和 619D OUT 0x01 / IN 0x81。

# ScanDebug_Runtime_ServiceEndpointInterfaceMismatch
source: Endpoint check failed. 619D OUT 0x01 and IN 0x81 must be on the same interface.
zh_cn: 端点检查失败。619D OUT 0x01 和 IN 0x81 必须位于同一接口上。

# ScanDebug_Runtime_ServiceScannerNotConnected
source: Scanner not connected. Click Connect Devices first.
zh_cn: 扫描仪未连接。请先点击“连接设备”。

# ScanDebug_Runtime_ServiceScannerNotConnectedShort
source: Scanner not connected.
zh_cn: 扫描仪未连接。

# ScanDebug_Runtime_StatusScanLinesConfigured
source: Scan lines configured. 619C input opened. Starting scan...
zh_cn: 扫描行已配置。619C 输入已打开。正在开始扫描...

# ScanDebug_Runtime_StatusReadStartedSendingStartScan
source: 619C read started. Sending START_SCAN...
zh_cn: 619C 读取已开始。正在发送 START_SCAN...

# ScanDebug_Runtime_StatusScanCommandSentReceiving
source: Scan command sent. Receiving image lines...
zh_cn: 扫描命令已发送。正在接收图像行...

# ScanDebug_Runtime_StatusAckMonitorTimedOut
source: START_SCAN ACK monitor timed out.
zh_cn: START_SCAN ACK 监视超时。

# ScanDebug_Runtime_StatusDeviceBusy
source: Device busy (cmd=0x{0}).
zh_cn: 设备忙碌（cmd=0x{0}）。

# ScanDebug_Runtime_StatusDeviceBusyTooLong
source: Device stayed busy for too long.
zh_cn: 设备忙碌时间过长。

# ScanDebug_Runtime_StatusStartScanAckStatus
source: START_SCAN ACK status: {0} (0x{1})
zh_cn: START_SCAN ACK 状态：{0} (0x{1})

# ScanDebug_Runtime_StatusStartScanAckTargetMismatch
source: START_SCAN ACK target mismatch: {0} (expected {1})
zh_cn: START_SCAN ACK 目标不匹配：{0}（预期 {1}）

# ScanDebug_Runtime_StatusStartScanAckReceived
source: START_SCAN ACK received.
zh_cn: 已收到 START_SCAN ACK。

# ScanDebug_Runtime_StatusStartScanDoneAckReceived
source: START_SCAN done ACK received.
zh_cn: 已收到 START_SCAN 完成 ACK。

# ScanDebug_Runtime_StatusStartScanDoneAckTimeout
source: START_SCAN done ACK not received in time.
zh_cn: 未及时收到 START_SCAN 完成 ACK。

# ScanDebug_Runtime_StatusScanCompleted
source: Scan completed.
zh_cn: 扫描已完成。

# ScanDebug_Runtime_StatusScanStopped
source: Scan stopped.
zh_cn: 扫描已停止。

# ScanDebug_Runtime_StatusScanCompletedInSegments
source: Scan completed in {0} segment(s).
zh_cn: 扫描已分 {0} 段完成。

# ScanDebug_Runtime_StatusScanFailedAfterMs
source: Scan failed after {0} ms: {1}
zh_cn: 扫描在 {0} ms 后失败：{1}

# ScanDebug_Runtime_StatusSegmentDoneAckTimeout
source: Segment {0}/{1} done ACK was not received in time.
zh_cn: 未及时收到第 {0}/{1} 段完成 ACK。

# ScanDebug_Runtime_StatusUnexpectedStopAck
source: Unexpected ACK command while stopping: 0x{0}
zh_cn: 停止时收到意外 ACK 命令：0x{0}

# ScanDebug_Runtime_StatusStopAckReceived
source: STOP_SCAN ACK received (target={0}, completed={1}).
zh_cn: 已收到 STOP_SCAN ACK（target={0}, completed={1}）。

# ScanDebug_Runtime_StatusStopAckStatus
source: STOP_SCAN ACK status: {0} (0x{1})
zh_cn: STOP_SCAN ACK 状态：{0} (0x{1})

# ScanDebug_Runtime_StatusStopSendFailed
source: STOP_SCAN send failed: {0}
zh_cn: 发送 STOP_SCAN 失败：{0}

# ScanDebug_Runtime_StatusUnexpectedWarmUpAck
source: Unexpected ACK command while enabling warm-up: 0x{0}
zh_cn: 启用预热时收到意外 ACK 命令：0x{0}

# ScanDebug_Runtime_StatusWarmUpAckStatus
source: WARM_UP ACK status: {0} (0x{1})
zh_cn: WARM_UP ACK 状态：{0} (0x{1})

# ScanDebug_Runtime_StatusWarmUpEnabledDetailed
source: Warm-up enabled (target={0}, completed={1}).
zh_cn: 预热已启用（target={0}, completed={1}）。

# ScanDebug_Runtime_StatusWarmUpCommandFailed
source: Warm-up command failed: {0}
zh_cn: 预热命令失败：{0}

# ScanDebug_Runtime_StatusScannerNotConnected
source: Scanner not connected. Click Connect Devices first.
zh_cn: 扫描仪未连接。请先点击“连接设备”。

# ScanDebug_Runtime_StatusApplyIgnoredDebounce
source: Apply ignored: please wait 1 second before next update.
zh_cn: 已忽略应用：请等待 1 秒后再更新。

# ScanDebug_Runtime_StatusDeviceClockInvalid
source: Device clock must be a MHz value from 30 to 200 with at most three decimal places.
zh_cn: 设备时钟必须是 30 到 200 范围内的 MHz 值，最多三位小数。

# ScanDebug_Runtime_StatusApplyingDeviceClock
source: Applying device clock...
zh_cn: 正在应用设备时钟...

# ScanDebug_Runtime_StatusDeviceClockUpdated
source: Device clock updated. Re-apply each channel before capture.
zh_cn: 设备时钟已更新。采集前请重新应用每个通道。

# ScanDebug_Runtime_StatusDeviceClockUpdateCanceled
source: Device clock update canceled.
zh_cn: 设备时钟更新已取消。

# ScanDebug_Runtime_StatusDeviceClockUpdateFailed
source: Device clock update failed: {0}
zh_cn: 设备时钟更新失败：{0}

# ScanDebug_Runtime_StatusApplyingParameters
source: Applying scan parameters...
zh_cn: 正在应用扫描参数...

# ScanDebug_Runtime_StatusParametersUpdated
source: Parameters updated successfully.
zh_cn: 参数更新成功。

# ScanDebug_Runtime_StatusParameterUpdateCanceled
source: Parameter update canceled.
zh_cn: 参数更新已取消。

# ScanDebug_Runtime_StatusParameterUpdateFailed
source: Parameter update failed: {0}
zh_cn: 参数更新失败：{0}

# ScanDebug_Runtime_StatusRefreshingIllumination
source: Refreshing illumination state...
zh_cn: 正在刷新照明状态...

# ScanDebug_Runtime_StatusIlluminationRefreshed
source: Illumination state refreshed.
zh_cn: 照明状态已刷新。

# ScanDebug_Runtime_StatusIlluminationRefreshCanceled
source: Illumination refresh canceled.
zh_cn: 照明刷新已取消。

# ScanDebug_Runtime_StatusIlluminationRefreshFailed
source: Illumination refresh failed: {0}
zh_cn: 照明刷新失败：{0}

# ScanDebug_Runtime_StatusApplyingIllumination
source: Applying illumination settings...
zh_cn: 正在应用照明设置...

# ScanDebug_Runtime_StatusIlluminationUpdated
source: Illumination settings updated.
zh_cn: 照明设置已更新。

# ScanDebug_Runtime_StatusIlluminationUpdateCanceled
source: Illumination update canceled.
zh_cn: 照明更新已取消。

# ScanDebug_Runtime_StatusIlluminationUpdateFailed
source: Illumination update failed: {0}
zh_cn: 照明更新失败：{0}

# ScanDebug_Runtime_StatusRefreshingMotion
source: Refreshing motion state...
zh_cn: 正在刷新运动状态...

# ScanDebug_Runtime_StatusMotionRefreshed
source: Motion state refreshed.
zh_cn: 运动状态已刷新。

# ScanDebug_Runtime_StatusMotionRefreshCanceled
source: Motion refresh canceled.
zh_cn: 运动刷新已取消。

# ScanDebug_Runtime_StatusMotionRefreshFailed
source: Motion refresh failed: {0}
zh_cn: 运动刷新失败：{0}

# ScanDebug_Runtime_StatusMotorMoveStarting
source: Starting finite move on {0}...
zh_cn: 正在开始 {0} 的有限移动...

# ScanDebug_Runtime_StatusMotorMoveCompleted
source: {0} move completed.
zh_cn: {0} 移动已完成。

# ScanDebug_Runtime_StatusMotorMoveCanceled
source: {0} move canceled.
zh_cn: {0} 移动已取消。

# ScanDebug_Runtime_StatusMotorMoveFailed
source: {0} move failed: {1}
zh_cn: {0} 移动失败：{1}

# ScanDebug_Runtime_StatusMotorStopping
source: Stopping {0}...
zh_cn: 正在停止 {0}...

# ScanDebug_Runtime_StatusMotorStopSent
source: {0} stop command sent.
zh_cn: {0} 停止命令已发送。

# ScanDebug_Runtime_StatusMotorStopCanceled
source: {0} stop canceled.
zh_cn: {0} 停止已取消。

# ScanDebug_Runtime_StatusMotorStopFailed
source: {0} stop failed: {1}
zh_cn: {0} 停止失败：{1}

# ScanDebug_Runtime_StatusMotorConfigApplying
source: Applying persisted config to {0}...
zh_cn: 正在将持久化配置应用到 {0}...

# ScanDebug_Runtime_StatusMotorConfigApplied
source: {0} config applied.
zh_cn: {0} 配置已应用。

# ScanDebug_Runtime_StatusMotorConfigCanceled
source: {0} config apply canceled.
zh_cn: {0} 配置应用已取消。

# ScanDebug_Runtime_StatusMotorConfigFailed
source: {0} config apply failed: {1}
zh_cn: {0} 配置应用失败：{1}

# ScanDebug_Runtime_StatusMotorEnabling
source: Enabling {0}...
zh_cn: 正在启用 {0}...

# ScanDebug_Runtime_StatusMotorDisabling
source: Disabling {0}...
zh_cn: 正在禁用 {0}...

# ScanDebug_Runtime_StatusMotorEnabled
source: {0} enabled.
zh_cn: {0} 已启用。

# ScanDebug_Runtime_StatusMotorDisabled
source: {0} disabled.
zh_cn: {0} 已禁用。

# ScanDebug_Runtime_StatusMotorEnableCanceled
source: {0} enable canceled.
zh_cn: {0} 启用已取消。

# ScanDebug_Runtime_StatusMotorDisableCanceled
source: {0} disable canceled.
zh_cn: {0} 禁用已取消。

# ScanDebug_Runtime_StatusMotorEnableFailed
source: {0} enable failed: {1}
zh_cn: {0} 启用失败：{1}

# ScanDebug_Runtime_StatusMotorDisableFailed
source: {0} disable failed: {1}
zh_cn: {0} 禁用失败：{1}

# ScanDebug_Runtime_StatusAutoBlackCompleted
source: Auto black calibration completed.
zh_cn: 自动黑电平校准已完成。

# ScanDebug_Runtime_StatusAutoWhiteCompleted
source: Auto white calibration completed.
zh_cn: 自动白电平校准已完成。

# ScanDebug_Runtime_StatusAutoCalibrationCompleted
source: Auto calibration completed.
zh_cn: 自动校准已完成。

# ScanDebug_Runtime_StatusCalibrationChannelProfileSaved
source: Calibration channel '{0}' profile saved.
zh_cn: 校准通道 '{0}' 的配置已保存。

# ScanDebug_Runtime_StatusSaveChannelProfileFailed
source: Save channel profile failed: {0}
zh_cn: 保存通道配置失败：{0}

# ScanDebug_Runtime_StatusCalibrationChannelEmpty
source: Calibration channel is empty.
zh_cn: 校准通道为空。

# ScanDebug_Runtime_StatusCalibrationChannelProfileCleared
source: Calibration channel '{0}' profile cleared.
zh_cn: 校准通道 '{0}' 的配置已清除。

# ScanDebug_Runtime_StatusCalibrationChannelNoSavedProfile
source: Calibration channel '{0}' has no saved profile.
zh_cn: 校准通道 '{0}' 没有已保存配置。

# ScanDebug_Runtime_StatusCalibrationChannelRemoveCanceled
source: Remove canceled for {0}.
zh_cn: 已取消移除 {0}。

# ScanDebug_Runtime_StatusClearChannelProfileFailed
source: Clear channel profile failed: {0}
zh_cn: 清除通道配置失败：{0}

# ScanDebug_Runtime_StatusFilmProfileExported
source: Film profile '{0}' exported.
zh_cn: 胶片配置 '{0}' 已导出。

# ScanDebug_Runtime_StatusFilmProfileExportCanceled
source: Save film profile canceled.
zh_cn: 保存胶片配置已取消。

# ScanDebug_Runtime_StatusFilmProfileInvalid
source: Film profile settings are invalid.
zh_cn: 胶片配置设置无效。

# ScanDebug_Runtime_StatusFilmProfileInvalidWithSummary
source: Film profile settings are invalid: {0}
zh_cn: 胶片配置设置无效：{0}

# ScanDebug_Runtime_StatusSaveFilmProfileFailed
source: Save film profile failed: {0}
zh_cn: 保存胶片配置失败：{0}

# ScanDebug_Runtime_StatusLoadFilmProfileCanceled
source: Load film profile canceled.
zh_cn: 加载胶片配置已取消。

# ScanDebug_Runtime_StatusFilmProfileLoaded
source: Film profile '{0}' loaded.
zh_cn: 胶片配置 '{0}' 已加载。

# ScanDebug_Runtime_StatusFilmProfileStaged
source: Film profile '{0}' read and staged for review. Current settings are unchanged.
zh_cn: 胶片配置 '{0}' 已读取并暂存以供审查。当前设置未更改。

# ScanDebug_Runtime_StatusFilmProfileApplied
source: Film profile '{0}' applied.
zh_cn: 胶片配置 '{0}' 已应用。

# ScanDebug_Runtime_StatusFilmProfileImportInvalid
source: The selected film profile could not be staged. Review the file and try again.
zh_cn: 所选胶片配置无法暂存。请检查文件后重试。

# ScanDebug_Runtime_StatusLoadFilmProfileFailed
source: Load film profile failed: {0}
zh_cn: 加载胶片配置失败：{0}

# ScanDebug_Runtime_FieldLed1Level
source: LED1 level
zh_cn: LED1 电平

# ScanDebug_Runtime_FieldLed2Level
source: LED2 level
zh_cn: LED2 电平

# ScanDebug_Runtime_FieldLed3Level
source: LED3 level
zh_cn: LED3 电平

# ScanDebug_Runtime_FieldLed4Level
source: LED4 level
zh_cn: LED4 电平

# ScanDebug_Runtime_FieldLed1PulseClock
source: LED1 pulse clocks
zh_cn: LED1 脉冲时钟数

# ScanDebug_Runtime_FieldLed2PulseClock
source: LED2 pulse clocks
zh_cn: LED2 脉冲时钟数
